Revit 2027 API
BuiltInFailures.SheetCollectionFailures.SheetCollectionDuplicateName Property
 Sheet Collection name is already in use. Provide a unique name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SheetCollectionDuplicateName { get; }
Public Shared ReadOnly Property SheetCollectionDuplicateName As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SheetCollectionDuplicateName {
	FailureDefinitionId^ get ();
}
static member SheetCollectionDuplicateName : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SheetCollectionFailures Class
Autodesk.Revit.DB Namespace